.emacs.d/myinit.org
* Interface tweaks 
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
(tool-bar-mode -1)
(fset 'yes-or-no-p 'y-or-n-p)
(global-set-key (kbd "<f5>") 'revert-buffer)
#+END_SRC

* Try
#+BEGIN_SRC emacs-lisp
(use-package try
  :ensure t)
#+END_SRC

* Which-key 
#+BEGIN_SRC emacs-lisp
(use-package which-key
	     :ensure t
	     :config
	     (which-key-mode))
#+END_SRC

* Org Mode Config 
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
     :config 
     (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  ;; Make windmove work in org-mode:
  (add-hook 'org-shiftup-final-hook 'windmove-up)
  (add-hook 'org-shiftleft-final-hook 'windmove-left)
  (add-hook 'org-shiftdown-final-hook 'windmove-down)
  (add-hook 'org-shiftright-final-hook 'windmove-right)
#+END_SRC

#+RESULTS:
: t

* Swiper 
#+BEGIN_SRC emacs-lisp
(use-package counsel
  :ensure t
  )

(use-package swiper
  :ensure try
  :config
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (global-set-key "\C-s" 'swiper)
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume)
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-load-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-c g") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
    (global-set-key (kbd "C-x l") 'counsel-locate)
    (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
    ))
#+END_SRC

* Buffer Listing
#+BEGIN_SRC emacs-lisp 
(defalias 'list-buffers 'ibuffer-other-window)
#+END_SRC

* Window Management
#+BEGIN_SRC emacs-lisp
(windmove-default-keybindings) ;; C-c arrow-key to go back in windows
(winner-mode 1) ;; Move through windows with shift arrow-key
#+END_SRC

* Auto-Complete
#+BEGIN_SRC emacs-lisp 
(use-package auto-complete
  :ensure t
  :init
  (progn
    (ac-config-default)
    (global-auto-complete-mode t)
    ))
#+END_SRC

* Reveal.js
#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
  :ensure ox-reveal)

  (setq org-reveal-root "file:///home/tom/.emacs.d/reveal.js")
  (setq org-reveal-mathjax t)

  (use-package htmlize
  :ensure t)
#+END_SRC

#+RESULTS:
* Web-mode 
#+BEGIN_SRC emacs-lisp
    (use-package web-mode
      :ensure t
      :config
	   (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
	   (setq web-mode-engines-alist
		 '(("django"    . "\\.html\\'")))
	   (setq web-mode-ac-sources-alist
		 '(("css" . (ac-source-css-property))
		   ("html" . (ac-source-words-in-buffer ac-source-abbrev))))

  (setq web-mode-enable-auto-closing t)
  (setq web-mode-enable-auto-quoting t))
#+END_SRC

* Flycheck 
#+BEGIN_SRC emacs-lisp
   (use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))
#+END_SRC

* Python 
#+BEGIN_SRC emacs-lisp 
  (use-package jedi
  :ensure t
  :init
  (add-hook 'python-mode-hook 'jedi:setup)
  (add-hook 'python-mode-hook 'jedi:ac-setup))
#+END_SRC

* Yasnippet
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1))
#+END_SRC

* Emmit 
#+BEGIN_SRC emacs-lisp
  (use-package emmet-mode
    :ensure t
    :config
    (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
    (add-hook 'web-mode-hook 'emmet-mode)  ;; Auto-start in web-mode
    (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
    )

  (setq emmet-move-cursor-between-quotes t) ;; default nil
#+END_SRC

* PDF-Tools
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
    :ensure t
    :config
    (pdf-tools-install)
      )
  (use-package org-pdfview
    :ensure t)
#+END_SRC

* Undo Tree
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
:ensure t
:init
(global-undo-tree-mode))
#+END_SRC
